krish2718/sdk-nrf/drivers/wifi/nrf700x/zephyr/src/qspi/src/qspi_if.c
/*
 * Copyright (c) 2022 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/**
 * @brief File containing QSPI device interface specific definitions for the
 * Zephyr OS layer of the Wi-Fi driver.
 */

#define DT_DRV_COMPAT nordic_nrf7002_qspi

#include <errno.h>
#include <init.h>
#include <string.h>
#include <logging/log.h>

#include "spi_nor.h"
#include <nrfx_qspi.h>
#include <hal/nrf_clock.h>

#include "qspi_if.h"

struct qspi_config *qspi_config;
unsigned int nonce_last_addr;
unsigned int nonce_cnt;

/* Main config structure */
static nrfx_qspi_config_t QSPIconfig;

/* Status register bits */
#define QSPI_SECTOR_SIZE SPI_NOR_SECTOR_SIZE
#define QSPI_BLOCK_SIZE SPI_NOR_BLOCK_SIZE


#define INST_0_SCK_FREQUENCY DT_INST_PROP(0, sck_frequency)
BUILD_ASSERT(INST_0_SCK_FREQUENCY >= (NRF_QSPI_BASE_CLOCK_FREQ / 16), "Unsupported SCK frequency.");

/* for accessing devicetree properties of the bus node */
#define QSPI_NODE DT_BUS(DT_DRV_INST(0))
#define QSPI_PROP_AT(prop, idx) DT_PROP_BY_IDX(QSPI_NODE, prop, idx)
#define QSPI_PROP_LEN(prop) DT_PROP_LEN(QSPI_NODE, prop)

#define INST_0_QER                                                                                 \
	_CONCAT(JESD216_DW15_QER_, DT_ENUM_TOKEN(DT_DRV_INST(0), quad_enable_requirements))

#if NRF52_ERRATA_122_PRESENT
#include <hal/nrf_gpio.h>
static int anomaly_122_init(const struct device *dev);
static void anomaly_122_uninit(const struct device *dev);

#define ANOMALY_122_INIT(dev) anomaly_122_init(dev)
#define ANOMALY_122_UNINIT(dev) anomaly_122_uninit(dev)
#else
#define ANOMALY_122_INIT(dev) 0
#define ANOMALY_122_UNINIT(dev)
#endif

#define WORD_SIZE 4

LOG_MODULE_DECLARE(wifi_nrf, CONFIG_WIFI_NRF_LOG_LEVEL);

/**
 * @brief QSPI buffer structure
 * Structure used both for TX and RX purposes.
 *
 * @param buf is a valid pointer to a data buffer.
 * Can not be NULL.
 * @param len is the length of the data to be handled.
 * If no data to transmit/receive - pass 0.
 */
struct qspi_buf {
	uint8_t *buf;
	size_t len;
};

/**
 * @brief QSPI command structure
 * Structure used for custom command usage.
 *
 * @param op_code is a command value (i.e 0x9F - get Jedec ID)
 * @param tx_buf structure used for TX purposes. Can be NULL if not used.
 * @param rx_buf structure used for RX purposes. Can be NULL if not used.
 */
struct qspi_cmd {
	uint8_t op_code;
	const struct qspi_buf *tx_buf;
	const struct qspi_buf *rx_buf;
};

/**
 * @brief Structure for defining the QSPI NOR access
 */
struct qspi_nor_data {
#ifdef CONFIG_MULTITHREADING
	/* The semaphore to control exclusive access on write/erase. */
	struct k_sem trans;
	/* The semaphore to control exclusive access to the device. */
	struct k_sem sem;
	/* The semaphore to indicate that transfer has completed. */
	struct k_sem sync;
#if NRF52_ERRATA_122_PRESENT
	/* The semaphore to control driver init/uninit. */
	struct k_sem count;
#endif
#else /* CONFIG_MULTITHREADING */
	/* A flag that signals completed transfer when threads are
	 * not enabled.
	 */
	volatile bool ready;
#endif /* CONFIG_MULTITHREADING */
};

static int qspi_nor_write_protection_set(const struct device *dev, bool write_protect);

static inline int qspi_get_mode(bool cpol, bool cpha)
{
	register int ret = -EINVAL;

	if ((!cpol) && (!cpha))
		ret = 0;
	else if (cpol && cpha)
		ret = 1;

	__ASSERT(ret != -EINVAL, "Invalid QSPI mode");

	return ret;
}

static inline bool qspi_write_is_quad(nrf_qspi_writeoc_t lines)
{
	switch (lines) {
	case NRF_QSPI_WRITEOC_PP4IO:
	case NRF_QSPI_WRITEOC_PP4O:
		return true;
	default:
		return false;
	}
}

static inline bool qspi_read_is_quad(nrf_qspi_readoc_t lines)
{
	switch (lines) {
	case NRF_QSPI_READOC_READ4IO:
	case NRF_QSPI_READOC_READ4O:
		return true;
	default:
		return false;
	}
}

static inline int qspi_get_lines_write(uint8_t lines)
{
	register int ret = -EINVAL;

	switch (lines) {
	case 3:
		ret = NRF_QSPI_WRITEOC_PP4IO;
		break;
	case 2:
		ret = NRF_QSPI_WRITEOC_PP4O;
		break;
	case 1:
		ret = NRF_QSPI_WRITEOC_PP2O;
		break;
	case 0:
		ret = NRF_QSPI_WRITEOC_PP;
		break;
	default:
		break;
	}

	__ASSERT(ret != -EINVAL, "Invalid QSPI write line");

	return ret;
}

static inline int qspi_get_lines_read(uint8_t lines)
{
	register int ret = -EINVAL;

	switch (lines) {
	case 4:
		ret = NRF_QSPI_READOC_READ4IO;
		break;
	case 3:
		ret = NRF_QSPI_READOC_READ4O;
		break;
	case 2:
		ret = NRF_QSPI_READOC_READ2IO;
		break;
	case 1:
		ret = NRF_QSPI_READOC_READ2O;
		break;
	case 0:
		ret = NRF_QSPI_READOC_FASTREAD;
		break;
	default:
		break;
	}

	__ASSERT(ret != -EINVAL, "Invalid QSPI read line");

	return ret;
}

static inline nrf_qspi_addrmode_t qspi_get_address_size(bool addr_size)
{
	return addr_size ? NRF_QSPI_ADDRMODE_32BIT : NRF_QSPI_ADDRMODE_24BIT;
}

nrfx_err_t nrfx_qspi_nondma_read(void *p_rx_buffer, size_t rx_buffer_length, uint32_t src_address)
{
	NRF_QSPI_Type *p_reg = NRF_QSPI;
#ifdef CONFIG_BOARD_NRF52840DK_NRF52840
	uint32_t *ACCESSREQ = &p_reg->RESERVED4[0];
	uint32_t *DATARW = &p_reg->RESERVED5[0];
#elif defined(CONFIG_NRFX_QSPI)
	uint32_t *ACCESSREQ = (uint32_t *)&p_reg->RESERVED8[0];
	uint32_t *DATARW = (uint32_t *)&p_reg->RESERVED9[0];
#endif
	unsigned int count;

	ACCESSREQ[0] = src_address;
	ACCESSREQ[1] = rx_buffer_length;
	ACCESSREQ[2] = 0;

	for (count = 0; count < rx_buffer_length; count += 4) {
		while (!(nrf_qspi_status_reg_get(p_reg) & 0x1))
			;
		memcpy(((char *)p_rx_buffer + count), &DATARW[0], sizeof(uint32_t));
	}

	return NRFX_SUCCESS;
}

nrfx_err_t nrfx_qspi_nondma_write(void const *p_tx_buffer, size_t tx_buffer_length,
				  uint32_t dst_address)
{
	NRF_QSPI_Type *p_reg = NRF_QSPI;
#ifdef CONFIG_BOARD_NRF52840DK_NRF52840
	uint32_t *ACCESSREQ = &p_reg->RESERVED4[0];
	uint32_t *DATARW = &p_reg->RESERVED5[0];
#elif defined(CONFIG_NRFX_QSPI)
	uint32_t *ACCESSREQ = (uint32_t *)&p_reg->RESERVED8[0];
	uint32_t *DATARW = (uint32_t *)&p_reg->RESERVED9[0];
#endif
	unsigned int count;

	ACCESSREQ[0] = dst_address;
	ACCESSREQ[1] = tx_buffer_length;
	ACCESSREQ[2] = 1;

	for (count = 0; count < tx_buffer_length; count += 4) {
		memcpy(&DATARW[0], ((char *)p_tx_buffer + count), sizeof(uint32_t));
		while (!(nrf_qspi_status_reg_get(p_reg) & 0x2))
			;
	}

	return NRFX_SUCCESS;
}

nrfx_err_t _nrfx_qspi_read(void *p_rx_buffer, size_t rx_buffer_length, uint32_t src_address)
{
	if (!qspi_config->easydma)
		return nrfx_qspi_nondma_read(p_rx_buffer, rx_buffer_length, src_address);

