krish2718/sdk-nrf/drivers/wifi/nrf700x/zephyr/src/qspi/src/qspi_if.c
	ANOMALY_122_UNINIT(dev);

	if (ret < 0)
		LOG_DBG("cmd_encryption failed %d\n", ret);

	return ret;
}
#endif

/* Wait until RDSR2 confirms RPU_WAKE write is successful */
int qspi_validate_rpu_wake_writecmd(const struct device *dev)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x2f,
		.rx_buf = &sr_buf,
	};

	for (int ii = 0; ii < 1; ii++) {
		ret = qspi_send_cmd(dev, &cmd, false);

		ANOMALY_122_UNINIT(dev);

		LOG_DBG("RDSR2 = 0x%x\n", sr);

		/* k_msleep(1); */
	}

	return ret;
}

int qspi_RDSR1(const struct device *dev)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x1f,
		.rx_buf = &sr_buf,
	};

	ret = ANOMALY_122_INIT(dev);

	ret = qspi_send_cmd(dev, &cmd, false);

	ANOMALY_122_UNINIT(dev);

	if (ret == 0)
		return sr;

	return ret;
}

/* Wait until RDSR1 confirms RPU_AWAKE/RPU_READY */
int qspi_wait_while_rpu_awake(const struct device *dev)
{
	int ret;

	for (int ii = 0; ii < 10; ii++) {
		ret = qspi_RDSR1(dev);

		if ((ret < 0) || ((ret & RPU_AWAKE_BIT) == 0)) {
			LOG_DBG("RDSR1 = 0x%x\t\n", ret);
		} else {
			LOG_DBG("RDSR1 = 0x%x\n", ret);
			break;
		}
		k_msleep(1);
	}

	return ret;
}

/* Wait until RDSR1 confirms RPU_AWAKE/RPU_READY and Firmware is booted */
int qspi_wait_while_firmware_awake(const struct device *dev)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x1f,
		.rx_buf = &sr_buf,
	};

	for (int ii = 0; ii < 10; ii++) {
		int ret;

		ret = ANOMALY_122_INIT(dev);

		if (ret == 0)
			ret = qspi_send_cmd(dev, &cmd, false);

		ANOMALY_122_UNINIT(dev);

		if ((ret < 0) || (sr != 0x6)) {
			LOG_DBG("ret val = 0x%x\t RDSR1 = 0x%x\n", ret, sr);
		} else {
			LOG_DBG("RDSR1 = 0x%x\n", sr);
			LOG_DBG("RPU is awake...\n");
			break;
		}
		k_msleep(1);
	}

	return ret;
}
int qspi_cmd_wakeup_rpu(const struct device *dev, uint8_t data)
{
	/* uint8_t data = 0x1; */

	/* printf("TODO : %s:\n", __func__); */

	const struct qspi_buf tx_buf = {
		.buf = &data,
		.len = sizeof(data),
	};
	const struct qspi_cmd cmd = {
		.op_code = 0x3f, /* 0x3f, //WRSR2(0x3F) WakeUP RPU. */
		.tx_buf = &tx_buf,
	};
	int ret = ANOMALY_122_INIT(dev);

	if (ret == 0)
		ret = qspi_send_cmd(dev, &cmd, false);

	ANOMALY_122_UNINIT(dev);

	if (ret < 0)
		LOG_ERR("cmd_wakeup RPU failed %d\n", ret);

	return ret;
}

struct device qspi_perip = {
	.data = &qspi_nor_memory_data,
};

int qspi_deinit(void)
{
	LOG_DBG("TODO : %s\n", __func__);

	return 0;
}

int qspi_init(struct qspi_config *config)
{
	unsigned int rc;

	qspi_config = config;

#if defined(CONFIG_NRFX_QSPI)
	/* QSPIM (6-96Mhz) : 192Mhz / (2*(SCKFREQ + 1)) */
	config->sckfreq = ((192 / config->freq) / 2) - 1;
#endif
#ifdef CONFIG_BOARD_NRF52840DK_NRF52840
	/* QSPIM (2-32Mhz): 32 MHz / (SCKFREQ + 1) */
	config->sckfreq = (32 / config->freq) - 1;
#endif

	config->readoc = config->quad_spi ? NRF_QSPI_READOC_READ4IO : NRF_QSPI_READOC_FASTREAD;
	config->writeoc = config->quad_spi ? NRF_QSPI_WRITEOC_PP4IO : NRF_QSPI_WRITEOC_PP;

	rc = qspi_nor_init(&qspi_perip);
	/* LOG_DBG("exited qspi_nor_init()\n"); */

	k_sem_init(&qspi_config->lock, 1, 1);

#if defined(CONFIG_NRFX_QSPI)
	/* once encryption is enabled, do not reinit until bitfile re-load */
	if (!config->enc_enabled) {
		if (config->encryption)
			nrfx_qspi_dma_encrypt(&config->p_cfg);

		if (config->CMD_CNONCE)
			qspi_cmd_encryption(&qspi_perip, &config->p_cfg);

		if (config->encryption)
			config->enc_enabled = true;
	}
#endif
	LOG_DBG("exiting %s\n", __func__);
	return rc;
}

void qspi_update_nonce(unsigned int addr, int len, int hlread)
{
#if defined(CONFIG_NRFX_QSPI)

	NRF_QSPI_Type *p_reg = NRF_QSPI;

	if (!qspi_config->encryption)
		return;

	if (nonce_last_addr == 0 || hlread)
		p_reg->DMA_ENC.NONCE2 = ++nonce_cnt;
	else if ((nonce_last_addr + 4) != addr)
		p_reg->DMA_ENC.NONCE2 = ++nonce_cnt;

	nonce_last_addr = addr + len - 4;

#endif
}

void qspi_addr_check(unsigned int addr, const void *data, unsigned int len)
{
	if ((addr % 4 != 0) || (((unsigned int)data) % 4 != 0) || (len % 4 != 0)) {
		LOG_DBG("%s : Unaligned address %x %x %d %x %x\n", __func__, addr,
		       (unsigned int)data, (addr % 4 != 0), (((unsigned int)data) % 4 != 0),
		       (len % 4 != 0));
	}
}

int qspi_write(unsigned int addr, const void *data, int len)
{
	int status;

	qspi_addr_check(addr, data, len);

	addr |= qspi_config->addrmask;

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, len, 0);

	status = qspi_nor_write(&qspi_perip, addr, data, len);

	k_sem_give(&qspi_config->lock);

	return status;
}

int qspi_read(unsigned int addr, void *data, int len)
{
	int status;

	qspi_addr_check(addr, data, len);

	addr |= qspi_config->addrmask;

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, len, 0);

	status = qspi_nor_read(&qspi_perip, addr, data, len);

	k_sem_give(&qspi_config->lock);

	return status;
}

int qspi_hl_readw(unsigned int addr, void *data)
{
	int status;
	uint8_t *rxb = NULL;
	uint32_t len = 4;

	len = len + (4 * qspi_config->qspi_slave_latency);

	rxb = k_malloc(len);

	if (rxb == NULL) {
		LOG_ERR("%s: ERROR ENOMEM line %d\n", __func__, __LINE__);
		return -ENOMEM;
	}

	memset(rxb, 0, len);

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, 4, 1);

	status = qspi_nor_read(&qspi_perip, addr, rxb, len);

	k_sem_give(&qspi_config->lock);

	*(uint32_t *)data = *(uint32_t *)(rxb + (len - 4));

	k_free(rxb);

	return status;
}

int qspi_hl_read(unsigned int addr, void *data, int len)
{
	int count = 0;

	qspi_addr_check(addr, data, len);

	while (count < (len / 4)) {
		qspi_hl_readw(addr + (4 * count), ((char *)data + (4 * count)));
		count++;
	}

	return 0;
}

int qspi_cmd_sleep_rpu(const struct device *dev)
{
	uint8_t data = 0x0;

	/* printf("TODO : %s:\n", __func__); */
	const struct qspi_buf tx_buf = {
		.buf = &data,
		.len = sizeof(data),
	};

	const struct qspi_cmd cmd = {
		.op_code = 0x3f, /* 0x3f, //WRSR2(0x3F) WakeUP RPU. */
		.tx_buf = &tx_buf,
	};

	int ret = ANOMALY_122_INIT(dev);

	if (ret == 0) {
		ret = qspi_send_cmd(dev, &cmd, false);
	}

	ANOMALY_122_UNINIT(dev);

	if (ret < 0) {
		LOG_ERR("cmd_wakeup RPU failed: %d\n", ret);
	}

	return ret;
}
